{
	"project_name": "Migration and Scalability",
	"description": "The project involved improving scalability by separating an EC2 instance running an application and two databases (Milvus and Supabase), and implementing auto-scaling for the application.",
	"year": "2023",
	"month": "8",
	"role": "",
	"project_type": "individual",
	"technologies_used": [
		{
			"name": "AWS EC2",
			"description": "Cloud service used to host and scale the application and databases."
		},
		{
			"name": "VPC & Subnets",
			"description": "Network configuration tools to ensure secure communication between EC2 instances."
		},
		{
			"name": "AWS ALB",
			"description": "Application Load Balancer used to route traffic to different EC2 instances based on path and service type."
		},
		{
			"name": "Docker & Docker Compose",
			"description": "Used for containerizing the application and databases, allowing easy deployment across instances."
		},
		{
			"name": "Auto-Scaling",
			"description": "Feature that automatically adjusts the number of EC2 instances for the application based on traffic."
		}
	],
	"infrastructure": [
		{
			"name": "EC2 Instances",
			"description": "Used to host both the application and databases in separate instances."
		},
		{
			"name": "Private Subnets",
			"description": "Created private subnets to improve security by isolating EC2 instances."
		},
		{
			"name": "Application Load Balancer",
			"description": "Used to distribute incoming traffic between different services based on routing configurations.",
			"steps": [
				"Set up ALB with target groups for application and database services.",
				"Configured path-based routing for specific traffic routing."
			]
		}
	],
	"skills_required": [
		{
			"name": "AWS EC2",
			"description": "Knowledge of launching, configuring, and managing EC2 instances."
		},
		{
			"name": "VPC & Subnets",
			"description": "Expertise in configuring VPC, subnets (public/private), and routing for network security."
		},
		{
			"name": "AWS ALB",
			"description": "Experience with setting up and configuring Application Load Balancers, as well as target groups for traffic routing."
		},
		{
			"name": "Docker & Docker Compose",
			"description": "Proficiency in containerization and orchestration using Docker Hub and Docker Compose."
		},
		{
			"name": "Auto-Scaling",
			"description": "Familiarity with configuring AWS Auto Scaling for EC2 instances."
		},
		{
			"name": "Database Migration",
			"description": "Understanding of migrating and managing databases like Milvus and Supabase."
		},
		{
			"name": "Security Best Practices",
			"description": "Experience with securing infrastructure by using private subnets and controlling access via ALB."
		}
	],
	"challenges_faced": [
		{
			"name": "Scalability",
			"description": "Ensuring the infrastructure could scale dynamically based on traffic."
		},
		{
			"name": "Migration Complexity",
			"description": "Successfully migrating the application and databases to separate instances without downtime."
		},
		{
			"name": "Security",
			"description": "Securing EC2 instances by moving them to private subnets and using proper access controls."
		}
	],
	"outcomes": [
		{
			"name": "Improved Scalability",
			"description": "Implemented auto-scaling for EC2 instances, improving the application's ability to handle varying traffic loads."
		},
		{
			"name": "Separation of Services",
			"description": "Successfully separated the application and databases into different EC2 instances, optimizing performance and security."
		}
	],
	"links": []
}
